# IStructuralSectionsServer Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IStructuralSectionsServer Interface
Members See Also
---
Interface for the section type parameter server to implement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public interface IStructuralSectionsServer : IExternalServer
```

Visual Basic
---
```text
Public Interface IStructuralSectionsServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IStructuralSectionsServer : IExternalServer
```

# See Also
IStructuralSectionsServer Members
Autodesk.Revit.DB.Structure Namespace